### **1. 결측치 처리**

In [1]:
#코드 8-1
import pandas as pd
import numpy as np

df = pd.DataFrame({'A': [1, 2, np.nan, 4, 5],
                   'B': [6, 7, 8, np.nan, 10],
                   'C': [11, 12, 13, np.nan, np.nan]})
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  NaN   8.0  13.0
3  4.0   NaN   NaN
4  5.0  10.0   NaN

In [2]:
#코드 8-2
pd.isna(df)

       A      B      C
0  False  False  False
1  False  False  False
2   True  False  False
3  False   True   True
4  False  False   True

In [3]:
df.info

<bound method DataFrame.info of      A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  NaN   8.0  13.0
3  4.0   NaN   NaN
4  5.0  10.0   NaN>

In [4]:
#코드 8-3
pd.isna(df).sum()

A    1
B    1
C    2
dtype: int64

In [ ]:
#코드 8-4
df_drop_nan = df.dropna() # 결측치 있는 행 제거
df_drop_nan

     A    B     C
0  1.0  6.0  11.0
1  2.0  7.0  12.0

In [6]:
#코드 8-5
df_drop_B_C = df.dropna(subset=['B','C'])
df_drop_B_C

     A    B     C
0  1.0  6.0  11.0
1  2.0  7.0  12.0
2  NaN  8.0  13.0

In [7]:
#코드 8-6
df_0 = df['C'].fillna(0)
print(df_0)

0    11.0
1    12.0
2    13.0
3     0.0
4     0.0
Name: C, dtype: float64

In [8]:
df

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  NaN   8.0  13.0
3  4.0   NaN   NaN
4  5.0  10.0   NaN

In [10]:
#코드 8-7
df_missing = df['A'].fillna('missing')
df_missing

0        1.0
1        2.0
2    missing
3        4.0
4        5.0
Name: A, dtype: object

In [9]:
#코드 8-8
# df.fillna(df.mean(), inplace=True)
df_mean = df.fillna(df.mean())
print(df, '\n')
print(df_mean)

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  NaN   8.0  13.0
3  4.0   NaN   NaN
4  5.0  10.0   NaN

     A      B     C
0  1.0   6.00  11.0
1  2.0   7.00  12.0
2  3.0   8.00  13.0
3  4.0   7.75  12.0
4  5.0  10.00  12.0

In [11]:
#코드 8-9
print(df, '\n')
#결측치 바로 위의 값으로 대체하기
df_ffill = df.fillna(method='ffill')
print(df_ffill, '\n')
#결측치 바로 아래의 값으로 대체하기
df_bfill = df.fillna(method='bfill')
print(df_bfill)

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  NaN   8.0  13.0
3  4.0   NaN   NaN
4  5.0  10.0   NaN

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  2.0   8.0  13.0
3  4.0   8.0  13.0
4  5.0  10.0  13.0

     A     B     C
0  1.0   6.0  11.0
1  2.0   7.0  12.0
2  4.0   8.0  13.0
3  4.0  10.0   NaN
4  5.0  10.0   NaN

C:\Users\asia\AppData\Local\Temp\ipykernel_25696\2695227071.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ffill = df.fillna(method='ffill')
C:\Users\asia\AppData\Local\Temp\ipykernel_25696\2695227071.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = df.fillna(method='bfill')

In [12]:
#코드 8-10
fill_dict = {'A': df['A'].mean(), 'B': '12/25', 'C': 'missing'}
df_filled = df.fillna(value=fill_dict)
df_filled

     A      B        C
0  1.0    6.0     11.0
1  2.0    7.0     12.0
2  3.0    8.0     13.0
3  4.0  12/25  missing
4  5.0   10.0  missing

### **2. 이상치**

### **3. 표준화와 정규화**